# Python and SQL

## Programming and Data Management (EDI 3400)

### *Vegard H. Larsen (Department of Data Science and Analytics)*

# 1.  Intro to `sqlite3`

In [1]:
# sqlite3 is part of the Standard Library

import sqlite3

In [2]:
# We can connect to our database
# Make sure the database is stored in the same folder as the notebook

con = sqlite3.connect("auto_dealership_database.db")

In [3]:
# In order to execute SQL statements and fetch results from SQL queries, 
# we will need to use a database cursor.

cur = con.cursor()

## Executing a query

In [17]:
# Now we are connected to the database and we have a cursor 
# and we can execute an SQL query

res = cur.execute("SELECT * FROM Employees")

In [16]:
# This gives us a cursor object

#res.fetchone()

(1, 'Erik', 114100, 'Bachelor', 'Sales')

In [18]:
# We can get all the information from the query using fetchall

employees_table = res.fetchall()

In [19]:
# The data is then stored as a list of tuples

employees_table

[(1, 'Erik', 114100, 'Bachelor', 'Sales'),
 (2, 'Sue', 116200, 'Bachelor', 'Admin'),
 (3, 'Linda', 67200, 'High School', 'Admin'),
 (4, 'Anne', 75900, 'Master', 'Service'),
 (5, 'Mary', 89100, 'Bachelor', 'Service'),
 (6, 'Tom', 95900, 'Bachelor', 'Sales'),
 (7, 'John', 148200, 'Bachelor', 'Sales'),
 (8, 'Joe', 148100, 'Master', 'Sales'),
 (9, 'Sofia', 117100, 'Bachelor', 'Sales'),
 (10, 'Marie', 79000, 'Bachelor', 'Admin'),
 (11, 'Bob', 72200, 'High School', 'Sales'),
 (12, 'Fred', 102000, 'High School', 'Sales'),
 (13, 'Sara', 59600, 'High School', 'Sales'),
 (14, 'Linda', 116300, 'Bachelor', 'Sales'),
 (15, 'Anne', 45600, 'Bachelor', 'Service'),
 (16, 'Karl', 136100, 'Master', 'Sales'),
 (17, 'Sally', 84100, 'Bachelor', 'Service'),
 (18, 'Tom', 79300, 'High School', 'Admin'),
 (19, 'Sara', 67200, 'High School', 'Service'),
 (20, 'Jane', 42300, 'High School', 'Service'),
 (21, 'Eli', 176500, 'Master', 'Sales'),
 (22, 'John', 44900, 'High School', 'Service'),
 (23, 'Chris', 68800, 'High School', 'Sales'),
 (24, 'Nora', 77300, 'High School', 'Sales'),
 (25, 'Mary', 104600, 'Master', 'Sales'),
 (26, 'Fredrik', 105700, 'Master', 'Service'),
 (27, 'Ina', 81200, 'High School', 'Sales'),
 (28, 'Sofia', 37800, 'High School', 'Service')]

## Convert the list into a Pandas dataframe

In [20]:
import pandas as pd

Employees = pd.DataFrame(employees_table)

In [21]:
# Let's inspect the dataframe

Employees.head(5)

   0      1       2            3        4
0  1   Erik  114100     Bachelor    Sales
1  2    Sue  116200     Bachelor    Admin
2  3  Linda   67200  High School    Admin
3  4   Anne   75900       Master  Service
4  5   Mary   89100     Bachelor  Service

## Let's set the column names

In [22]:
# Get the column names from the Employees table 

tmp = cur.execute("SELECT name FROM PRAGMA_TABLE_INFO('Employees')").fetchall()

In [23]:
# Let's inspect the result from the query

tmp

[('id',), ('name',), ('salary',), ('education',), ('department',)]

In [26]:
# Change the list of tuples into a list of strings

employees_column_names = [name[0] for name in tmp]
employees_column_names

['id', 'name', 'salary', 'education', 'department']

In [27]:
# Add the column names to the dataframe

Employees.columns = employees_column_names

In [28]:
# We set the id column to be the index column

Employees.index = Employees['id']
del Employees['id']

In [29]:
# Let's look at the Employees dataframe

Employees.head(10)

     name  salary    education department
id
1    Erik  114100     Bachelor      Sales
2     Sue  116200     Bachelor      Admin
3   Linda   67200  High School      Admin
4    Anne   75900       Master    Service
5    Mary   89100     Bachelor    Service
6     Tom   95900     Bachelor      Sales
7    John  148200     Bachelor      Sales
8     Joe  148100       Master      Sales
9   Sofia  117100     Bachelor      Sales
10  Marie   79000     Bachelor      Admin

In [30]:
# Remember to close the connection

con.close()

# 2. SQL queries with Pandas

In [31]:
import sqlite3
import pandas as pd

con = sqlite3.connect("auto_dealership_database.db")
Customers = pd.read_sql("SELECT * FROM Customers", con)
con.close()

In [32]:
Customers

        id first_name last_name     phone  birth_year
0        1    Geffery     Eaton  46000950        2011
1        2       Nira     Perry  98553493        2003
2        3   Moneisha     Perry  99054734        1998
3        4  Sigourney     Noble  24082013        1966
4        5     Lavita   Carlson  31488331        1984
...    ...        ...       ...       ...         ...
3831  3832    Roselee    Lucero  33966455        1984
3832  3833   Shawneen  Espinoza  22244378        2008
3833  3834   Jennafer   Salgado  45636078        1983
3834  3835    Aleisha   Skinner  84333759        1981
3835  3836   Evagelia    Porter  91034390        1978

[3836 rows x 5 columns]

## The query is defined within a Python string

In [33]:
query = """
        SELECT *
        FROM Customers
        WHERE birth_year = 1995
        """

In [35]:
print(query)

        SELECT *
        FROM Customers
        WHERE birth_year = 1995

In [37]:
con = sqlite3.connect("auto_dealership_database.db")
result = pd.read_sql(query, con)
con.close()

In [38]:
result

      id first_name  last_name     phone  birth_year
0     28   Terrence     Bender  43369797        1995
1     69   Jondavid  Schroeder  93789105        1995
2     74      Lanay       Holt  56850116        1995
3     77     Doanld      Knapp  30017393        1995
4     83    Shahera   Gallegos  72819621        1995
..   ...        ...        ...       ...         ...
65  3591     Deadra    Anthony  62066997        1995
66  3627  Celestino      Walls  88097571        1995
67  3641        Naa    Rosario  20679719        1995
68  3715      Sheva   Roberson  86000267        1995
69  3759      Nalee   Caldwell  73049285        1995

[70 rows x 5 columns]

# 3. Let us create a database

### Datatypes in SQLite

- **NULL**. The value is a NULL value.

- **INTEGER**. The value is a signed integer, stored in 0, 1, 2, 3, 4, 6, or 8 bytes depending on the magnitude of the value.

- **REAL**. The value is a floating point value, stored as an 8-byte IEEE floating point number.

- **TEXT**. The value is a text string, stored using the database encoding (UTF-8, UTF-16BE or UTF-16LE).

- **BLOB**. The value is a blob of data, stored exactly as it was input.

In [66]:
## Imports

import pandas as pd
import sqlite3

In [67]:
!rm example_database.db
!ls

Lecture13_EDI3400_Fall2022.ipynb auto_dealership_database.db
Lecture_13_Solutions.ipynb

In [68]:
con = sqlite3.connect('example_database.db')

In [70]:
ls

Lecture13_EDI3400_Fall2022.ipynb  auto_dealership_database.db
Lecture_13_Solutions.ipynb        example_database.db

In [72]:
## Create the cursor

cursor = con.cursor()

In [74]:
cursor.execute?

In [60]:
cursor.execute('''CREATE TABLE Employees(id INTEGER PRIMARY KEY,
                                         name TEXT,
                                         salary INTEGER,  
                                         education TEXT)''')

In [61]:
sqlite_insert = """
                INSERT INTO Employees(id, name, salary, education) 
                VALUES(1, 'Nora', 100000, 'Master')
                """ 

cursor.execute(sqlite_insert)

In [62]:
# Commit the employees data to the database

con.commit()
con.close()

In [63]:
# Let's look at our newly created table

con = sqlite3.connect("example_database.db")
Employees2 = pd.read_sql("SELECT * FROM Employees", con)
con.close()

Employees2

   id  name  salary education
0   1  Nora  100000    Master

In [64]:
# We can add another row

con = sqlite3.connect('example_database.db') 
cursor = con.cursor()
sqlite_insert = """
                INSERT INTO Employees(id, name, salary, education) 
                VALUES(2, 'Ted', 90000, 'High school')
                """ 

cursor.execute(sqlite_insert)
cursor.commit()
cursor.close()

In [65]:
con = sqlite3.connect("example_database.db")
Employees2 = pd.read_sql("SELECT * FROM Employees", con)
con.close()

Employees2

   id  name  salary    education
0   1  Nora  100000       Master
1   2   Ted   90000  High school

# 4. Adding many rows to a database from Python

In [75]:
# Create some random data

import numpy as np

ids = np.arange(1, 101)
ages = np.random.randint(18, 75, size=100)
names = np.random.choice(['John', 'Jane', 'Mary', 'Bob', 'Tom', 'Jack', 'Karl', 'Sue', 'Sally', 'Ida'],
                         size=100)

In [76]:
# Create the table in our example database

con = sqlite3.connect('example_database.db')
cursor = con.cursor()
cursor.execute('''CREATE TABLE Customers(id INTEGER PRIMARY KEY,
                                         name STRING,
                                         age INTEGER)''')

In [77]:
# We use a for loop to add the data
# We can use a f-string to change the content of the sql-code for each iteration of the loop

for i in range(100):
    sqlite_insert = f"INSERT INTO Customers(id, name, age) VALUES({ids[i]}, '{names[i]}', {ages[i]})"
    con.execute(sqlite_insert)
con.commit()
con.close()

In [78]:
# Let's look at the new table

con = sqlite3.connect("example_database.db")
Customers2 = pd.read_sql("SELECT * FROM Customers", con)
con.close()

Customers2

     id  name  age
0     1  John   22
1     2   Ida   44
2     3  Jane   50
3     4  Jane   20
4     5  John   32
..  ...   ...  ...
95   96  Karl   28
96   97   Sue   48
97   98  Karl   33
98   99  Mary   40
99  100  Jack   36

[100 rows x 3 columns]